const express = require('express');
const fileUpload = require('express-fileupload');
const fs = require('fs');
const ncp = require('ncp').ncp;
const rimraf = require('rimraf');

const app = express();
app.use(fileUpload());

// Генаратор Лендинга
app.post('/generate_lp', function (req, res) {
    if (!req.files) {
        return res.status(400).send('No files were uploaded.');
    }

    // удаляем папку build
    rimraf('./build', function () {
        console.log('1. Удалил папку build');
    });

    // создаем папку build
    fs.mkdir('./build', function () {
        console.log('Создал папку build');
    });

    // перенос данных с папки src в папку build
    ncp('src', 'build', function (err) {
        if (err) {
            return console.error(err);
        }
        console.log('Перенес все с папки src в build');


        let adminTitle = req.body.adminTitle; // Название страницы
        let adminPrice = parseInt(req.body.adminPrice); // Цена
        let adminDiscount = parseInt(req.body.adminDiscount); // Скидка
        let adminOldPrice = parseInt((adminPrice / (100 - adminDiscount)) * 100); // Старая цена

        let adminBg = req.files.adminBg; // Фон
        let adminHeader = req.files.adminHeader; // Картинка шапки
        let adminTopBanner = req.files.adminTopBanner; // Верхний баннер
        let adminContent = req.files.adminContent; // Картинка контента
        let adminBottomBanner = req.files.adminBottomBanner; // нижний баннер
        let adminSlide1 = req.files.adminSlide1; // первый слайдер
        let adminSlide2 = req.files.adminSlide2; // второй слайдер

        // Переносим файлы в Media
        adminBg.mv('./build/static/media/' + adminBg.name);
        adminHeader.mv('./build/static/media/' + adminHeader.name);
        adminTopBanner.mv('./build/static/media/' + adminTopBanner.name);
        adminContent.mv('./build/static/media/' + adminContent.name);
        adminBottomBanner.mv('./build/static/media/' + adminBottomBanner.name);
        adminSlide1.mv('./build/static/media/' + adminSlide1.name);
        adminSlide2.mv('./build/static/media/' + adminSlide2.name);

        let html = `
<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="UTF-8">
    <title>${adminTitle}</title>

    <link href="https://fonts.googleapis.com/css?family=Roboto:300,400,700,900&subset=cyrillic" rel="stylesheet">
    <link rel="stylesheet" href="static/js/libs/magnific/magnific-popup.css">
    <link rel="stylesheet" href="static/js/libs/slick/slick/slick.css">
    <link rel="stylesheet" href="./static/css/normalize.css">
    <link rel="stylesheet" href="./static/css/main.css">
</head>
<body>

<div class="wrapper">

    <header class="page-header">

        <div class="container">

            <div class="page-header__inner">
                <a href="#order" class="page-header__link btn-orange js-scroll">Закажи сейчас!</a>
            </div>

        </div>

    </header>

    <section class="page-content">
        <div class="container">

            <div class="first-section">
                <div class="first-section__left">
                    <ul class="first-slider" id="js-first-slider">
                        <li class="first-slider__item">
                            <img src="static/media/slider1.jpg" alt="1" class="first-slider__image"
                                 draggable="false">
                        </li>
                        <li class="first-slider__item">
                            <img src="static/media/slider2.jpg" alt="2" class="first-slider__image"
                                 draggable="false">
                        </li>
                    </ul>
                </div>
                <div class="first-section__right">
                    <img src="static/media/first-banner.jpg" alt="" draggable="false">
                    <div class="top-discount">
                        <span class="top-discount__int">${adminDiscount}</span>
                        <span class="top-discount__text">скидка</span>
                    </div>
                    <div class="top-new-price">
                        <span class="top-new-price__int">${adminPrice}</span>
                    </div>
                    <div class="top-old-price">
                        <span class="top-old-price__text">Старая цена:</span>
                        <span class="top-old-price__int">${adminOldPrice}</span>
                    </div>
                </div>
            </div>

            <div class="second-section">
                <img src="static/media/content.png" class="second-section__img" alt="content" draggable="false">
            </div>

            <div class="order-section" id="order">
                <div class="order-section__left">
                    <img src="static/media/order-banner.jpg" class="order-section__banner" alt="bottom banner"
                         draggable="false">
                    <div class="order-price">
                        <div class="bottom-discount">
                            <span class="bottom-discount__int">${adminDiscount}</span>
                            <span class="bottom-discount__text">скидка</span>
                        </div>
                        <div class="bottom-new-price">
                            <span class="bottom-new-price__int">${adminPrice}</span>
                        </div>
                        <div class="bottom-old-price">
                            <span class="bottom-old-price__text">Старая цена:</span>
                            <span class="bottom-old-price__int">${adminOldPrice}</span>
                        </div>
                    </div>
                </div>
                <div class="order-section__right">

                    <div class="order-block">
                        <h3 class="order-block__title">Оформи заказ</h3>
                        <form class="order-form" method="post">
                            <div class="order-form__item">
                                <label for="order-form__name" class="order-form__label">Имя*</label>
                                <input type="text" id="order-form__name" class="order-form__field"
                                       placeholder="Ваше имя" required>
                            </div>
                            <div class="order-form__item">
                                <label for="order-form__phone" class="order-form__label">Телефон*</label>
                                <input type="text" id="order-form__phone" class="order-form__field"
                                       placeholder="+7 (___) ___-__-__" required>
                            </div>
                            <div class="legal-unit">

                                <label class="legal-unit__text">
                                    <input type="checkbox" class="legal-unit__check">
                                    <span class="checkbox-custom"></span>
                                    <span class="checkbox-label">
                                        Нажимая кнопку «Оформи заказ!», я даю согласие на
                                        <a href="#personal-data-processing" class="test-popup-link">
                                            обработку персональных данных
                                        </a>,
                                        согласие с
                                        <a href="#policy-personal-data" class="test-popup-link">
                                            Политикой обработки персональных данных</a> и
                                        <a href="#custom-agreement" class="test-popup-link">Пользовательским
                                            соглашением</a>.
                                    </span>
                                </label>
                            </div>
                            <p class="following-the-law">
                                Следуя закону РФ №152 «О персональных данных»,
                                мы обязаны не раскрывать третьим лицам и не распространять
                                ваши персональные данные без вашего согласия.
                            </p>
                            <button class="btn-orange">Оформи заказ!</button>
                        </form>

                        <div class="delivery">
                            <span>Доставка по России!</span>
                        </div>

                    </div>

                </div>
            </div>

        </div>
    </section>

    <footer class="page-footer">
        <div class="container">
            <div class="page-footer__inner">
                <p class="page-footer__left">
                    Copyright © Владелец сайта ООО "Теледирект", 2017<br>
                    ОГРН 1137746573810<br>
                    119530, г. Москва, Очаковское шоссе, дом 28, стр. 2, пом. III, ком. 8<br>
                    Товар может быть доставлен от партнеров.
                </p>
                <div class="page-footer__right">
                    <a href="#policy-personal-data" class="page-footer__link test-popup-link">Политика обработки
                        персональных данных</a>
                    <a href="#personal-data-processing" class="page-footer__link test-popup-link">Согласие на обработку
                        персональных данных</a>
                    <a href="#custom-agreement" class="page-footer__link test-popup-link">Пользовательское
                        соглашение</a>
                </div>
            </div>
        </div>
    </footer>

</div>

<div class="hidden-modals">
    <div class="policy-personal-data" id="policy-personal-data">

        <h3 class="policy-personal-data__title">Политика обработки персональных данных
            <span>(утверждена приказом от 07.06.2017 года)</span>
        </h3>
        <p>Настоящая Политика в отношении обработки и защиты персональных данных (далее – «Политика») принята и
            действует в отношении персональных данных, передаваемых и/или получаемых от пользователей сайта. Настоящая
            Политика имеет публичный характер и размещается на сайте в свободном доступе для третьих лиц.</p>
        <p>Владелец сайта собирает, обрабатывает, использует и охраняет персональные данные, которые предоставляются
            пользователями сайта при его посещении в сети интернет с любого устройства и при коммуникации с владельцем
            сайта в любой форме, в соответствии с настоящей Политикой.</p>
        <p>Используя данный сайт и предоставляя свои персональные данные, каждый пользователь сайта дает согласие на
            обработку его персональных данных в соответствии с настоящей Политикой.</p>

        <h4>1. Понятия и определения, используемые в настоящей Политике</h4>
        <p>«Персональные данные» – любая информация, относящаяся к прямо или косвенно определённому или определяемому
            физическому лицу (субъекту персональных данных);</p>
        <p>«Обработка персональных данных» - любое действие (операция) или совокупность действий (операций), совершаемых
            с использованием средств автоматизации или без использования таких средств с персональными данными, включая
            сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение,
            использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление,
            уничтожение персональных данных;</p>
        <p>«Автоматизированная обработка персональных данных» – обработка персональных данных с помощью средств
            вычислительной техники;</p>
        <p>«Распространение персональных данных» - действия, направленные на раскрытие персональных данных
            неопределённому кругу лиц (передача персональных данных) или на ознакомление с персональными данными
            неограниченного круга лиц, в том числе обнародование персональных данных в средствах массовой информации,
            размещение в информационно-телекоммуникационных сетях или предоставление доступа к персональным данным
            каким-либо иным способом;</p>
        <p>«Предоставление персональных данных» – действия, направленные на раскрытие персональных данных определённому
            лицу или определённому кругу лиц;</p>
        <p>«Блокирование персональных данных» - временное прекращение обработки персональных данных (за исключением
            случаев, если обработка необходима для уточнения персональных данных);</p>
        <p>«Уничтожение персональных данных» - действия, в результате которых невозможно восстановить содержание
            персональных данных в информационной системе персональных данных и (или) результате которых уничтожаются
            материальные носители персональных данных;</p>
        <p>«Обезличивание персональных данных» - действия, в результате которых невозможно определить без использования
            дополнительной информации принадлежность персональных данных конкретному субъекту персональных данных;</p>
        <p>«Информационная система персональных данных» - совокупность содержащихся в базах данных персональных данных,
            и обеспечивающих их обработку информационных технологий и технических средств;</p>
        <p>«Трансграничная передача персональных данных» - передача персональных данных на территорию иностранного
            государства органу власти иностранного государства, иностранному физическому или иностранному юридическому
            лицу.</p>
        <p>«Сайт» - группа страниц в сети интернет, объединенная одним доменным именем второго уровня, на одной из
            страниц которого расположена настоящая Политика.</p>
        <p>«Владелец сайта» - юридическое лицо, указанное внизу на стартовой (первой) странице сайта. Владелец сайта и
            владелец соответствующего доменного имени второго уровня могут не совпадать.</p>
        <p>«Пользователь сайта (пользователь)» - лицо, использующее сайт и его возможности в
            ознакомительно-информационных (справочных) целях и/или желающее приобрести (приобретающее) товары и/или
            услуги, предлагаемые на сайте.</p>

        <h4>2. Персональные данные, которые собирает владелец сайта</h4>
        <p>· персональные данные, которые пользователь предоставляете владельцу сайта при заполнении информационных
            полей на сайте, в том числе при заполнении контактной формы, при подписке на новостную рассылку, при
            регистрации на мероприятия;</p>
        <p>· персональные данные и другая информация, содержащаяся в сообщениях, которые пользователь направляет
            владельцу сайта;</p>
        <p>· технические данные, которые автоматически передаются устройством, с помощью которого пользователь
            использует сайт, в том числе технические характеристики устройства, IP-адрес, информация, сохраненная в
            файлах «cookies», которые были отправлены на устройство пользователя, информация о браузере, дата и время
            доступа к сайту, адреса запрашиваемых страниц и иная подобная информация технического обмена;</p>
        <p>· иные данные о пользователе, которые пользователь пожелал оставить на сайте, включая комментарии, отзывы,
            запросы, жалобы, письма и проч.</p>

        <h4>3. Цели обработки данных, сроки</h4>
        <p>Мы обрабатываем Ваши персональные данные исключительно для тех целей, для которых они были предоставлены при
            заполнении форм, в том числе:</p>
        <p>· регистрации пользователя как покупателя товаров и услуг;</p>
        <p>· регистрации пользователя на сайте для предоставления ему доступа к отдельным его разделам и/или регистрации
            пользователя как лица, обладающего преимуществами перед другими пользователями (обладатели дисконтных карт,
            членов клубов и т.д.);</p>
        <p>· предоставления пользователю информации о владельце сайта, услугах, товарах, акциях и мероприятиях;</p>
        <p>· коммуникации с пользователем;</p>
        <p>· организации участия пользователя в акциях, мероприятиях и опросах;</p>
        <p>· проведения идентификации пользователя в программах лояльности, обеспечения процедуры учета накопления и
            использования бонусов, осуществление доставки товаров и услуг, предоставление сервисных услуг,
            распространения рекламных сообщений (в т.ч. о проводимых акциях и специальных предложениях через любые
            каналы коммуникации, в том числе по почте, SMS, электронной почте, телефону, иным средствам связи), сбора
            мнения о работе настоящего сайта, о товаре;</p>
        <p>· направления пользователю новостных материалов, информации о движении приобретенного товара, условиях
            проводимых акций, проводимых распродажах, анонсах, рекламных сообщений;</p>
        <p>· выполнения обязанностей, возложенных на владельца сайта законодательством Российской Федерации;</p>
        <p>· для других целей, прямо связанных с целями, указанными выше.</p>
        <p>Владелец сайта обрабатывает технические данные для:</p>
        <p>· обеспечения функционирования и безопасности сайта;</p>
        <p>· улучшения качества наших сайта;</p>
        <p>· определения часового пояса выхода пользователя в сеть интернет для исключения ночных обращений к
            пользователю (для подтверждения сделанных покупок).</p>
        <p>Владелец сайта не размещает персональные данные пользователя в открытых или общедоступных источниках.
            Владелец сайта не принимает решений, порождающих для пользователя юридические последствия или иным образом
            затрагивающих права пользователя и его законные интересы на основании исключительно автоматизированной
            обработки персональных данных.</p>
        <p>Владелец сайта не распространяет персональные данные пользователя. Владелец сайта предоставляет персональные
            данные пользователя Обществу с ограниченной ответственностью «Интернет Технологии», ОГРН 5117746022081,
            Юридический адрес 410012, Саратовская обл., г. Саратов, ул. Московская, дом № 66 исключительно с целями,
            указанными в настоящей Политике. Владелец сайта предоставляет персональные данные пользователя следующим
            организациям (с целью выполнения своих обязательств пред пользователем, в части адреса, номера телефона и
            ФИО): Почте России, другим почтовым компаниям, курьерским службам/компаниям, компаниям связи; налоговым
            органам (если владелец сайта является налоговым агентом по отношению к пользователю), компетентным органам
            по их запросу.</p>
        <p>Пользователь предоставляет свое согласие на обработку персональных данных сроком 5 лет, либо до тех пор, пока
            обработка не будет прекращена в соответствии с настоящей Политикой.</p>

        <h4>4. Права пользователя</h4>
        <p>Обеспечение защиты прав пользователя и свобод в сфере персональных данных – обязательное условие работы
            владельца сайта.</p>
        <p>Чтобы обеспечить защиту прав, свобод и персональных данных, по просьбе (заявлению) пользователя владелец
            сайта:</p>
        <p>· подтверждает, обрабатывает ли он персональные данные пользователя и предоставит пользователю возможность с
            ними ознакомиться в течение 30 дней с даты получения запроса пользователя;</p>
        <p>· сообщит пользователю об источнике получения и составе персональных данных пользователя, которые
            обрабатывает владелец сайта;</p>
        <p>· сообщит пользователю о правовых основаниях, целях, сроках и способах обработки персональных данных
            пользователя;</p>
        <p>· внесет необходимые изменения в персональные данные пользователя, если пользователь подтвердит, что они
            неполные, неточные или неактуальные, в течение 7 рабочих дней с даты получения подтверждения;</p>
        <p>· уведомит пользователя о порядке осуществления прав пользователя при обработке владельцем сайта персональных
            данных;</p>
        <p>· исключит пользователя из рассылки новостных материалов и/или рассылки иных любых других материалов и
            информации;</p>
        <p>· прекратит обработку персональных данных пользователя в течение 30 дней с даты получения отзыва
            предоставленного ранее согласия, если для обработки персональных данных не будет иных правовых оснований,
            предусмотренных законодательством Российской Федерации;</p>
        <p>· прекратит обработку персональных данных пользователя без просьбы (заявления) пользователя, если будет
            установлено, что владелец обрабатывает их неправомерно;</p>
        <p>· уничтожит персональные данные пользователя, если будет установлено, что они незаконно получены или не
            соответствуют заявленным целям обработки, в течение 7 рабочих дней с даты получения соответствующего
            подтверждения;</p>
        <p>· ответит на запросы пользователя, касающиеся персональных данных пользователя.</p>

        <h4>5. Как пользователь может связаться с владельцем сайта</h4>
        <p>Пользователь может обратиться к владельцу сайта с запросом (отзывом согласия), касающимся обработки
            персональных данных пользователя, направив письмо на адрес электронной почты: internet_content@ttstv.ru или
            на следующий адрес: Куда: 119530, г. Москва, Очаковское шоссе, дом 28, стр. 2, пом. III, ком. 8. Кому: ООО
            «Теледирект».</p>

        <h4>6. Безопасность персональных данных</h4>
        <p>Для обеспечения безопасности персональных данных пользователя при их обработке владелец сайта принимает
            необходимые и достаточные правовые, организационные и технические меры для защиты персональных данных от
            неправомерного или случайного доступа к ним, их уничтожения, изменения, блокирования, копирования,
            предоставления, распространения, а также от иных неправомерных действий в отношении персональных данных.</p>
        <p>Владелец сайта принял локальные акты по вопросам безопасности персональных данных. Сотрудники владельца
            компании, имеющие доступ к персональным данным, ознакомлены с настоящей Политикой и локальными актами по
            вопросам безопасности персональных данных.</p>

        <h4>7. Трансграничная передача персональных данных, хранение и обработка</h4>
        <p>Владелец сайта не осуществляет передачу персональных данных пользователя на территорию иностранных
            государств, не передает их иностранным физическим или юридическим лицам. Хранение персональных данных и их
            обработка производится на серверах, расположенных на территории РФ. Хранение и обработка персональных данных
            пользователя производится на территории РФ и в том случае, если доменное имя сайта первого уровня имеет имя,
            отличное от .ruили .рф.</p>

        <h4>8. Прекращение обработки персональных данных и/или уничтожение персональных данных</h4>
        <p>Владелец сайта прекращает обработку персональных данных пользователя и/или уничтожает их:</p>
        <p>· при наступлении условий прекращения обработки персональных данных или по истечении установленных
            (оговоренных) сроков;</p>
        <p>· по достижении целей их обработки либо в случае утраты необходимости в достижении этих целей;</p>
        <p>· по требованию пользователя;</p>
        <p>· в случае выявления неправомерной обработки персональных данных;</p>
        <p>· по истечении срока действия согласия пользователя на обработку персональных данных или в случае отзыва
            пользователем такого согласия, если для обработки персональных данных не будет иных правовых оснований,
            предусмотренных законодательством Российской Федерации;</p>
        <p>· в случае ликвидации владельца сайта.</p>

        <h4>9. Cookies</h4>
        <p>Владелец сайта использует файлы «cookies». Файлы «cookies» – это небольшие текстовые файлы, размещаемые на
            жестких дисках устройств пользователя во время использования различных сайтов, предназначенные для
            содействия в настройке пользовательского интерфейса в соответствии с предпочтениями пользователя.</p>
        <p>Большинство браузеров позволяют пользователю отказаться от получения файлов «cookies» и удалить их с жесткого
            диска устройства.</p>

        <h4>10. Ссылки на сайты третьих лиц</h4>
        <p>На сайте могут быть размещены ссылки на сторонние сайты и службы, которые владелец сайта не контролирует.
            Владелец сайта не несет ответственности за безопасность или конфиденциальность любой информации, собираемой
            сторонними сайтами или службами.</p>

        <h4>11. Изменение Политики</h4>
        <p>Владелец сайта может обновлять Политику по мере необходимости. Владелец сайта рекомендует пользователю
            периодически проверять актуальность настоящей Политики. Продолжая пользоваться сайтом после изменения
            Политики, пользователь подтверждает согласие с внесенными изменениями.</p>
    </div>

    <div class="personal-data-processing" id="personal-data-processing">
        <h3 class="personal-data-processing__title">Согласие на обработку персональных данных</h3>
        <p>Я, Пользователь сайта (субъект персональных данных), оставляя заявку (информацию) на настоящем
            интернет-сайте <span class="text-link">http://teledirekt.ru</span>, выражаю настоящее
            Согласие на обработку моих персональных данных (далее – Согласие).
            Действуя свободно, своей волей и в своем интересе, а также подтверждая свою дееспособность,
            я даю свое согласие владельцу сайта и Обществу с ограниченной ответственностью
            «Интернет Технологии», ОГРН 5117746022081, юридический адрес 410012,
            Саратовская обл., г. Саратов, ул. Московская, дом № 66, на обработку своих персональных
            данных со следующими условиями:
        </p>
        <p>1. Данное Согласие дается на обработку персональных данных, как без использования средств
            автоматизации, так и с их использованием. Согласие предоставляется в соответствии с
            Политикой обработки персональных данных, действующей у владельца сайта.
        </p>
        <p>2. Согласие дается на обработку следующих моих персональных данных, которые я предоставляю:
            фамилии, имени, отчества, пола, даты рождения, адреса, номеров контактных телефонов,
            адреса электронной почты, места работы и занимаемой должности, а также пользовательские
            данные (сведения о местоположении; тип и версия ОС; тип и версия браузера; тип устройства
            и разрешение его экрана; источник откуда перешел на сайт пользователь; с какого сайта или
            по какой рекламе; язык ОС и браузера; какие страницы открывает и на какие кнопки нажимает
            пользователь; ip-адрес).
        </p>
        <p>3. Персональные данные не являются общедоступными.
        </p>
        <p>4. Цель обработки персональных данных: в соответствии с целями, указанными в Политике
            обработки персональных данных, действующей у владельца сайта, с целью покупки товаров
            и услуг, получения информации.
        </p>
        <p>5. В ходе обработки с персональными данными будут совершены следующие действия: сбор;
            запись; систематизация; накопление; хранение; уточнение (обновление, изменение);
            извлечение; использование; передача (распространение, предоставление, доступ);
            блокирование; удаление; уничтожение.
        </p>
        <p>6. Персональные данные обрабатываются до отписки пользователя от рекламных и новостных
            рассылок и/или выполнения обязательств перед пользователем и/или отзыва настоящего
            согласия и/или иных оснований, предусмотренных Политикой обработки персональных данных.
            Также обработка персональных данных может быть прекращена по запросу субъекта персональных
            данных в любое время по адресу, указанному в настоящем Согласии.
        </p>
        <p>7. Настоящее согласие действует все время до момента прекращения обработки персональных
            данных, указанных в настоящем согласии и/или Политике обработки персональных данных,
            действующих у владельца сайта.
        </p>
    </div>

    <div class="custom-agreement" id="custom-agreement">
        <h3 class="custom-agreement__title">Пользовательское соглашение</h3>
        <p>Я (Покупатель) принимаю условия Пользовательского соглашения.</p>
        <p>Пользовательское соглашение</p>
        <p>Настоящее соглашение содержит основные условия, в соответствии с которыми осуществляется продажа товаров
            и/услуг. Покупатель вправе не принимать настоящее пользовательское соглашение, что повлечет за собой отказ
            от заключения договора.</p><h4>О Покупателе и платежах</h4>
        <p>Покупатель подтверждает, что он имеет право на заключение договора купли-продажи товара и что информация,
            предоставляемая им, является достоверной. При оплате товара с помощью электронных средств платежа
            (банковская карта, интернет-деньги и т.д.) Покупатель подтверждает, что данные платежи осуществляются с
            помощью законных средств платежа, находящихся у Покупателя на законных основаниях.</p>

        <h4>Об информации на сайте и информации о товаре</h4>
        <p>Владельцем данного сайта приняты все разумные меры к тому, чтобы обеспечить точность и актуальность
            размещенной на этом сайте информации, однако ее точность и полнота не могут быть гарантированы. Владелец
            сайта оставляет за собой право вносить изменение в содержание материалов этого сайта в любое время по
            собственному усмотрению. Если не указано иное, Товар, находящийся на сайте в продаже, принадлежит владельцу
            сайта. Владельцем сайта является юридическое лицо, указанное в низу стартовой страницы сайта. Владелец сайта
            может не совпадать с владельцем соответсвующего доменного имени сайта.</p>

        <h4>Об ограничении ответственности при пользовании информацией с сайта</h4>
        <p>При любом развитии событий, в связи с возможностью/невозможностью использования ресурсов данного сайта, а
            также в связи с использованием любой информации с данного сайта кем-либо, если такое использование или
            невозможность использования информации принесло какой-либо вред, Владелец сайта и его контрагенты не несут
            ответственности за какой-либо прямой, косвенный, случайный либо сопутствующий ущерб, в особенности, ущерб от
            упущенной выгоды, потери прибыльности, роста расходов, потери информации и т.п.</p>

        <h4>О правах третьих лиц, копировании информации</h4>
        <p>Товарные знаки, изображенные на данном сайте, принадлежат их владельцам и не могут быть использованы третьими
            лицами без разрешения владельцев. Размещение товарных знаков на данном сайте не предоставляет третьим лицам
            никаких прав копирования товарных знаков и размещения их на других ресурсах (товарах). Копирование
            информации с данного сайта и ее размещение на других ресурсах в коммерческих целях не допускается.</p>

        <h4>О доставке</h4>
        <p>В случае доставки товара Покупателю третьими лицами (Почта России, курьерские службы, экспедиторские компании
            и т.д.), сроки доставки и правила доставки регулируются правилами, действующими в этих организациях.</p>

        <h4>О возврате товара</h4>
        <p>Покупатель вправе возвратить товар надлежащего качества в течение 7 дней, при условии сохранения его
            потребительских свойств, товарного вида и документов, прилагаемых к товару при покупке.</p>
        <p>Покупатель вправе возвратить товар ненадлежащего качества в пределах его гарантийного срока, который равен 1
            году и исчисляется с даты получения Товара Покупателем. Если в документах, сопровождающих товар, установлен
            другой срок, Гарантийный срок равен этому другому сроку.</p>
        <p>Возврат любого товара производится по адресу, указанному в Договоре-заказе, а именно в Заявлении на возврат
            товара.</p>

        <h4>О возврате денежных средств</h4>
        <p>При оплате товара наличными на Почте России (наложенный платеж), у курьерских организаций, в пунктах выдачи
            товаров возврат денежных средств производится Продавцом в течение 10 дней с даты возврата товара, денежным
            переводом Почты России по адресу Покупателя, указанному Покупателем при заключении договора и на имя
            Покупателя. Покупатель несет риск невозврата денежных средств и/или товаров при озвучивании вымышленного
            имени и/или адреса при заключении договора.</p>
        <p>При оплате товара банковской картой или иным средством электронного платежа, денежные средства возвращаются
            на ту же карту и тот же счет (аккаунт, учетную запись, кошелек и т.д.), откуда был совершен платеж, в
            течение 10 дней с даты возврата товара Продавцу.</p>
        <p>В любом из указанных случаев возврата платежа срок возврата увеличивается на время, которое требуется почте
            или банковским организациям для осуществления перевода.</p>
        <p>В случаях, предусмотренных законодательством, Продавец вправе удержать расходы, понесенные в связи с
            доставкой товаров от Покупателя Продавцу.</p>

        <h4>О претензиях, сервисе и ремонте</h4>
        <p>Прием претензий от Покупателя, ремонт и техническое обслуживание Товара производит Продавец по телефону
            Службы клиентского сервиса и по адресу, указанному в Заявлении на возврат товара в Договоре-заказе.</p>
        <p>Продавец, его адрес, телефон службы клиентского сервиса, адрес приема товара в случае обмена, ремонта,
            возврата указывается в Договоре-заказе.</p>

        <h4>О качестве товаров</h4>
        <p>Владелец сайта гарантирует, что товары, находящиеся в продаже на данном сайте, соответствуют качеству,
            предусмотренному законодательством РФ для данных товаров. При обнаружении некачественного товара
            производится замена товара за счет Продавца по правилам замены, указанных в документах, приложенных к товару
            при покупке.</p>

        <h4>О Согласии на предоставление персональных данных</h4>
        <p>Покупатель добровольно дает согласие на обработку, в т.ч. на сбор, запись,
            систематизацию, накопление, хранение, (уточнение, обновление, изменение),
            извлечение, передачу, использование, обезличивание, блокирование, уничтожение,
            его персональных данных, предоставляемых при покупке товара, Обществу с ограниченной
            ответственностью «Интернет Технологии», ОГРН 5117746022081, Юридический адрес 410012,
            Саратовская обл., г. Саратов, ул. Московская, дом № 66, с целью предоставления товаров
            и услуг (продуктов), проведения идентификации участника в программе лояльности, обеспечения
            процедуры учета накопления и использования бонусов, осуществление доставки, предоставление
            сервисных услуг, распространения рекламных сообщений (в т.ч. о проводимых акциях и специальных
            предложениях через любые каналы коммуникации, в том числе по почте, SMS, электронной почте,
            телефону, иным средствам связи), сбора мнения о работе настоящего сайта, о товаре. Покупатель
            согласен, что его персональные данные будут обрабатываться способами, соответствующими целям
            обработки персональных данных, без возможности принятия решения на основании исключительно
            автоматизированной обработки его персональных данных. Данное согласие предоставляется сроком
            на 5 лет и может быть отозвано Покупателем в любое время посредством направления заказного
            письма по адресу, указанному в настоящей статье.</p>
    </div>
</div>

<script src="https://ajax.googleapis.com/ajax/libs/jquery/3.2.1/jquery.min.js"></script>
<script src="static/js/libs/magnific/jquery.magnific-popup.js"></script>
<script src="static/js/libs/slick/slick/slick.min.js"></script>
<script src="./static/js/main.js"></script>
</body>
</html>
`;


        fs.writeFileSync('build/index.html', html, (err) => {
            if (err) throw err;
            console.log('Изменил файл build/index.html!');
        });
    });

    res.send('Лендинг Создан');
});


// запуск сервера
app.listen(3003, function () {
    console.log('Listen 3003');
});
